Revit 2024 API
BuiltInFailures.BeamSystemFailures Class
 Failures about BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class BeamSystemFailures
Visual Basic
Public NotInheritable Class BeamSystemFailures
Visual C++
public ref class BeamSystemFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures
See Also
BuiltInFailures.BeamSystemFailures Members
Autodesk.Revit.DB Namespace